//==================================================
// 土壌水分センサー制御
// Capacitive Soil Moisture Sensor V1.2の初期化と土壌水分の取得処理を実装する
//==================================================

#include "soil_sensor.h"

#include <Arduino.h>

//======================================
// V1.2設定
//======================================

#define SOIL_PIN 34

//======================================
// V1.2初期化
//======================================
void initSoilSensor()
{
    pinMode(SOIL_PIN, INPUT);
}

//======================================
// 土壌水分量を取得
//======================================
void readSoil(SensorData &data)
{
    // ADC値を取得
    data.soilRaw = analogRead(SOIL_PIN);
}