//==================================================
// センサーデータモデル
// 各種センサーの計測データを管理する構造体を定義する
//==================================================

#ifndef SENSOR_DATA_H
#define SENSOR_DATA_H

#include <Arduino.h>

struct SensorData
{
    //========================
    // 基本情報
    //========================

    uint16_t plantId;   // 植物ID
    uint32_t timestamp; // 計測時刻(ms)

    //========================
    // 環境データ
    //========================

    float temperature;  // 温度(℃)
    float humidity;     // 湿度(%)
    int soilRaw;   // 土壌水分生データ(%)
    float illuminance;  // 光量(lx -> lux(ルクス))

    //========================
    // 状態
    //========================

    bool isValid;         // データ取得成功かどうか
};

#endif
